Removed Latex-formatting and added mermaid graphs
